strejda/freebsd/usr.sbin/fwcamctl/fwcamctl.8
.\" Copyright (c) 2026 Abdelkader Boudih <freebsd@seuros.com>
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd May 27, 2026
.Dt FWCAMCTL 8
.Os
.Sh NAME
.Nm fwcamctl
.Nd control utility for IIDC FireWire cameras
.Sh SYNOPSIS
.Nm
.Op Fl f Ar device
.Cm info
.Nm
.Op Fl f Ar device
.Cm snap
.Op Fl o Ar output.ppm
.Op Fl s Ar skip
.Nm
.Op Fl f Ar device
.Cm mode
.Ar format mode rate
.Nm
.Op Fl f Ar device
.Cm feat get
.Ar id
.Nm
.Op Fl f Ar device
.Cm feat set
.Ar id value Op Ar value2
.Sh DESCRIPTION
The
.Nm
utility controls IIDC 1394-based digital cameras via the
.Xr fwcam 4
driver.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl f Ar device
Specify the camera device.
Defaults to
.Pa /dev/fwcam0 .
.El
.Pp
The subcommands are:
.Bl -tag -width indent
.It Cm info
Display camera state, current format/mode/framerate, supported formats,
basic function capabilities, and present features.
.It Cm snap Op Fl o Ar output.ppm Op Fl s Ar skip
Capture a single video frame and write it as a PPM image.
.Pp
.Bl -tag -width indent -compact
.It Fl o Ar output.ppm
Output file path.
Use
.Sq -
for stdout.
Defaults to
.Pa snap.ppm .
.It Fl s Ar skip
Number of frames to skip before capturing, to allow auto-exposure
and auto-white-balance to settle.
Defaults to 5.
.El
.Pp
Supported pixel formats: YUV444, YUV422, YUV411, RGB8, Mono8.
The frame is converted to RGB24 and written as a binary PPM (P6).
.It Cm mode Ar format mode rate
Set the camera video format, mode, and frame rate.
All arguments are integer indices per the IIDC specification.
Only Format_0 (VGA) is currently supported by the
.Xr fwcam 4
frame assembly path.
.Pp
Format_0 modes:
.Bl -column "Mode" "Resolution" "Pixel format" -compact
.It Em Mode Ta Em Resolution Ta Em Pixel format
.It 0 Ta 160x120 Ta YUV444
.It 1 Ta 320x240 Ta YUV422
.It 2 Ta 640x480 Ta YUV411
.It 3 Ta 640x480 Ta YUV422
.It 4 Ta 640x480 Ta RGB8
.It 5 Ta 640x480 Ta Mono8
.El
.Pp
Frame rates: 0=1.875 1=3.75 2=7.5 3=15 4=30 5=60 fps.
.It Cm feat get Ar id
Query the camera feature with the given numeric ID and display its
inquiry (presence, on/off, auto, manual, range) and current value.
.It Cm feat set Ar id value Op Ar value2
Set the camera feature with the given numeric ID to
.Ar value .
For the
.Sq white_balance
feature (id 3),
.Ar value
is the U/B component and
.Ar value2
is the V/R component.
.El
.Pp
Feature IDs:
.Bl -column "ID" "Name" -compact
.It Em ID Ta Em Name
.It 0 Ta brightness
.It 1 Ta auto_exposure
.It 2 Ta sharpness
.It 3 Ta white_balance
.It 4 Ta hue
.It 5 Ta saturation
.It 6 Ta gamma
.It 7 Ta shutter
.It 8 Ta gain
.It 9 Ta iris
.It 10 Ta focus
.It 11 Ta temperature
.It 12 Ta trigger
.It 13 Ta zoom
.It 14 Ta pan
.It 15 Ta tilt
.El
.Sh EXAMPLES
Show camera information:
.Bd -literal -offset indent
fwcamctl info
.Ed
.Pp
Capture a photo to
.Pa photo.ppm ,
skipping 10 frames for AE to settle:
.Bd -literal -offset indent
fwcamctl snap -o photo.ppm -s 10
.Ed
.Pp
Switch to 320x240 YUV422 at 30 fps:
.Bd -literal -offset indent
fwcamctl mode 0 1 4
.Ed
.Pp
Read the current gain value:
.Bd -literal -offset indent
fwcamctl feat get 8
.Ed
.Pp
Set brightness to 200:
.Bd -literal -offset indent
fwcamctl feat set 0 200
.Ed
.Sh SEE ALSO
.Xr fwcam 4 ,
.Xr fwcontrol 8
.Sh AUTHORS
.An Abdelkader Boudih Aq Mt freebsd@seuros.com
